SET NAMES utf8mb4;

DELETE FROM devices;

INSERT INTO devices (
  device_code,
  label_key,
  name,
  type,
  status,
  serial_number,
  location
)
VALUES
  ('DEV001', '1# 550kV I 线高抗', '1号SVG无功补偿柜', '静止无功发生柜', 'normal', 'SN100001', '仿真园区 A 区 01 位'),
  ('DEV002', '1#220KW 二次设备舱', '1号智能控制柜', '智能控制柜', 'normal', 'SN100002', '仿真园区 A 区 02 位'),
  ('DEV003', '1#变压器', '1号综合配电柜', '综合配电柜', 'normal', 'SN100003', '仿真园区 A 区 03 位'),
  ('DEV004', '1#设备', '1号中压进线柜', '中置式中压开关柜', 'normal', 'SN100004', '仿真园区 A 区 04 位'),
  ('DEV005', '1#设备.001', '1号低压馈线柜', '智能低压开关柜', 'normal', 'SN100005', '仿真园区 A 区 05 位'),
  ('DEV006', '1#设备.002', '1号低压动力柜', '低压动力柜', 'normal', 'SN100006', '仿真园区 A 区 06 位'),
  ('DEV007', '1#隔离开关', '1号气体绝缘开关柜', '气体绝缘开关柜', 'normal', 'SN100007', '仿真园区 A 区 07 位'),
  ('DEV008', '10#设备', '10号精密列头柜', '精密列头柜', 'normal', 'SN100008', '仿真园区 A 区 08 位'),
  ('DEV009', '10#设备.001', '10号UPS输入输出柜', 'UPS柜', 'error', 'SN100009', '仿真园区 A 区 09 位'),
  ('DEV010', '11#设备', '11号直流馈电柜', '直流电源柜', 'normal', 'SN100010', '仿真园区 A 区 10 位'),
  ('DEV011', '11#设备.001', '11号网络监控柜', '网络机柜', 'normal', 'SN100011', '仿真园区 A 区 11 位'),
  ('DEV012', '12#设备', '12号终端配电箱', '智能配电箱', 'normal', 'SN100012', '仿真园区 A 区 12 位'),
  ('DEV013', '12#设备.001', '12号有源滤波柜', '动态滤波补偿柜', 'error', 'SN100013', '仿真园区 A 区 13 位'),
  ('DEV014', '2# 550kV I 线高抗', '2号SVG无功补偿柜', '静止无功发生柜', 'error', 'SN100014', '仿真园区 A 区 14 位'),
  ('DEV015', '2#220KW 二次设备舱', '2号智能控制柜', '智能控制柜', 'error', 'SN100015', '仿真园区 A 区 15 位'),
  ('DEV016', '2#变压器', '2号UPS电源柜', 'UPS柜', 'normal', 'SN100016', '仿真园区 A 区 16 位'),
  ('DEV017', '2#设备', '2号中压进线柜', '中置式中压开关柜', 'normal', 'SN100017', '仿真园区 A 区 17 位'),
  ('DEV018', '2#设备.001', '2号低压馈线柜', '智能低压开关柜', 'normal', 'SN100018', '仿真园区 B 区 01 位'),
  ('DEV019', '2#设备.002', '2号低压动力柜', '低压动力柜', 'normal', 'SN100019', '仿真园区 B 区 02 位'),
  ('DEV020', '2#隔离开关', '2号中压开关柜', '中置式中压开关柜', 'normal', 'SN100020', '仿真园区 B 区 03 位'),
  ('DEV021', '3# 550kV I 线高抗', '3号SVG无功补偿柜', '静止无功发生柜', 'normal', 'SN100021', '仿真园区 B 区 04 位'),
  ('DEV022', '3#220KW 二次设备舱', '3号智能控制柜', '智能控制柜', 'normal', 'SN100022', '仿真园区 B 区 05 位'),
  ('DEV023', '3#变压器', '3号通信电源柜', '直流电源柜', 'normal', 'SN100023', '仿真园区 B 区 06 位'),
  ('DEV024', '3#设备', '3号精密列头柜', '精密列头柜', 'normal', 'SN100024', '仿真园区 B 区 07 位'),
  ('DEV025', '3#设备.001', '3号UPS输入输出柜', 'UPS柜', 'normal', 'SN100025', '仿真园区 B 区 08 位'),
  ('DEV026', '3#设备.002', '3号直流馈电柜', '直流电源柜', 'normal', 'SN100026', '仿真园区 B 区 09 位'),
  ('DEV027', '3#隔离开关', '3号气体绝缘开关柜', '气体绝缘开关柜', 'normal', 'SN100027', '仿真园区 B 区 10 位'),
  ('DEV028', '4# 550kV I 线高抗', '4号SVG无功补偿柜', '静止无功发生柜', 'normal', 'SN100028', '仿真园区 B 区 11 位'),
  ('DEV029', '4#变压器', '4号综合配电柜', '综合配电柜', 'normal', 'SN100029', '仿真园区 B 区 12 位'),
  ('DEV030', '4#设备', '4号网络监控柜', '网络机柜', 'normal', 'SN100030', '仿真园区 B 区 13 位'),
  ('DEV031', '4#设备.001', '4号终端配电箱', '智能配电箱', 'normal', 'SN100031', '仿真园区 B 区 14 位'),
  ('DEV032', '4#设备.002', '4号有源滤波柜', '动态滤波补偿柜', 'normal', 'SN100032', '仿真园区 B 区 15 位');
